food-cart-api/app/controllers/application_controller.rb

    def authorize
        @current_user = User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]