food-cart-api/app/controllers/carts_controller.rb

    def index
        carts = Cart.all
---
SELECT "carts".* FROM "carts"

    def find_cart
        Cart.find(params[:id])
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]