food-cart-api/app/controllers/orders_controller.rb

DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 6]]
---
def destroy
    order = Order.find(params[:id])
    order.destroy