food-cart-api/app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders"
---
    def index
        orders = Order.all

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def show
        order = Order.find(params[:id])

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "orders" ("food_id", "user_id", "price", "cart_id", "created_at", "updated_at", "quantity") VALUES (?, ?, ?, ?, ?, ?, ?)  [["food_id", 3], ["user_id", nil], ["price", nil], ["cart_id", 1], ["created_at", "2023-04-02 14:34:31.064877"], ["updated_at", "2023-04-02 14:34:31.064877"], ["quantity", nil]]
---
def create
    # Find the Cart record to add the item to
    cart = Cart.find(params[:cart_id])
        # Find the Food record that was selected
    food = Food.find(params[:food_id])
        # Create a new Order record that belongs to both the Cart and Food
    order = Order.create!(cart: cart, food: food, quantity: params[:quantity], price: food.price, user_id: params[:user_id])

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "orders" SET "updated_at" = ?, "quantity" = ? WHERE "orders"."id" = ?  [["updated_at", "2023-04-02 14:56:28.152624"], ["quantity", 2], ["id", 1]]
---
def update
    order = Order.find(params[:id])
    order.update(order_params)

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
DELETE FROM "orders" WHERE "orders"."id" = ?  [["id", 14]]
---
def destroy
    cart = Cart.find(params[:cart_id])
    order = Order.find(params[:id])
    order.destroy