food-cart-api/app/controllers/users_controller.rb

    def show
        user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

    def create
        user = User.create(user_params)
---
INSERT INTO "users" ("username", "email", "password_digest", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def update
        user = User.find(params[:id])
        if user
            User.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "ZaKi12"], ["updated_at", "2023-03-29 12:37:47.859215"], ["id", 1]]

    def destroy
        user = User.find(params[:id])
        if user
            user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 7]]

    def change_password
        user = User.find(params[:id])
        if user && user.authenticate(params[:current_password])
            user.update(password: params[:new_password])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "[FILTERED]"], ["updated_at", "2023-03-30 10:35:59.357849"], ["id", 5]]